[{"_id":"57aee300efd68f06f8de6ac7","Title":"Ağ İşletim Sistemleri","Subtitle":"Giriş","ImageUrl":"/Assets/DataImages/ag-giris.png","Description":"Bu bölüm, ağ ilkelerine, standartlarına ve amaçlarına genel bir bakış sağlamaktadır.\r\n\r\nBir ağ oluşturmak için gerekli olan farklı tipteki ağ topolojileri, protokolleri, mantıksal modelleri ve donanım bu bölümde ele alınacaktır. Bunlara ek olarak, ağ bileşeni yükseltmeleri, e-posta sunucusu kurulumları ve yapılandırması, sorun giderme ve sorun önleyici bakımlar işlenecektir. Ayrıca ağ yazılımı, iletişim yöntemleri ve donanım ilişkilerini de öğreneceksiniz.\r\n\r\nMüşterilerinizin ve ağ kullanıcılarının beklentilerini ve ihtiyaçlarını karşılamak için ağ teknolojilerine aşina olmalısınız. Ağ tasarımının temellerini ve bazı bileşenlerin ağ üzerindeki veri akışını nasıl etkilediğini öğreneceksiniz. Bu bilgiler, başarılı bir şekilde ağ sorunlarını gidermenize yardımcı olacaktır."},{"_id":"57aee3bbefd68f06f8de6ac8","Title":"Ağ İlkeleri","Subtitle":"Bilgisayar Ağları","ImageUrl":"/Assets/DataImages/bilgisayar-aglari.png","Description":"Ağlar, bağlarla oluşturulan sistemlerdir. Örneğin, bir grup insanı birbirine bağlayan yollar fiziksel bir ağ oluşturur. Arkadaşlarınızla olan bağlantılar, sizin kişisel ağınızı oluşturur. Kişilerin birbirlerinin sayfalarına bağ oluşturmalarına izin veren web sitelerine sosyal ağ siteleri denir.\r\n\r\nKullanıcılar aşağıdaki ağları her gün kullanır:\r\n<ul>\r\n \t<li>E-Posta dağıtım sistemi</li>\r\n</ul>\r\n<ul>\r\n \t<li>Telefon sistemi</li>\r\n</ul>\r\n<ul>\r\n \t<li>Toplu taşıma sistemi</li>\r\n</ul>\r\n<ul>\r\n \t<li>Kurumsal bilgisayar ağı</li>\r\n</ul>\r\n<ul>\r\n \t<li>İnternet</li>\r\n</ul>\r\nAğlar, bilgi paylaşır ve bu bilgi akışını yönlendirmek için çeşitli yöntemler kullanır. Ağdaki bilgiler, doğru hedefine varmak için bazen farklı farklı yollar üzerinden bir yerden diğerine yol alır. Örneğin, toplu taşıma sistemi ağı, bilgisayar ağına benzer bir ağdır. Arabalar, kamyonlar ve diğer araçlar, ağ içinde seyahat eden iletiler gibidir. Her sürücü, bir başlangıç noktası (kaynak bilgisayar) ve bitiş noktası (hedef bilgisayar) belirler. Bu sistem içinde, kaynak ile hedef arasındaki akışı denetleyen dur işaretleri ve trafik ışıkları gibi kurallar vardır. Bir bilgisayar ağı da, ağ üzerindeki konak bilgisayarlar arasındaki veri akışını kontrol etmek için kurallar kullanır.\r\n\r\nKonak bilgisayar, ağ üzerinde bilgi gönderip alan herhangi bir cihazdır. Bazı cihazlar, konak bilgisayar veya çevresel aygıt olarak hizmet verebilir. Örneğin, ağda bulunan dizüstü bilgisayarınıza bağlı bir yazıcı, çevresel aygıt olarak işlev gösterir. Yazıcı, doğrudan ağa bağlıysa, konak bilgisayar olarak işlev gösteriyordur.\r\n\r\nFarklı türde birçok cihaz, bir ağa bağlanabilir:\r\n<ul>\r\n \t<li>Masaüstü bilgisayarlar</li>\r\n</ul>\r\n<ul>\r\n \t<li>Dizüstü bilgisayarlar</li>\r\n</ul>\r\n<ul>\r\n \t<li>Tablet bilgisayarlar</li>\r\n</ul>\r\n<ul>\r\n \t<li>Akıllı Telefonlar</li>\r\n</ul>\r\n<ul>\r\n \t<li>Yazıcılar</li>\r\n</ul>\r\n<ul>\r\n \t<li>Dosya ve yazıcı sunucuları</li>\r\n</ul>\r\n<ul>\r\n \t<li>Oyun konsolları</li>\r\n</ul>\r\n<ul>\r\n \t<li>Ev aletleri</li>\r\n</ul>\r\nBilgisayar ağları dünya genelinde, şirketlerde, evlerde, okullarda ve devlet dairelerinde kullanılır. Ağların çoğu İnternet üzerinden birbirine bağlanır. Ağda, farklı türde birçok kaynak ve veri paylaşılabilir:\r\n<ul>\r\n \t<li>Yazdırma veya tarama gibi hizmetler</li>\r\n</ul>\r\n<ul>\r\n \t<li>Sabit disk veya optik sürücü gibi çıkarılabilir aygıtlar üzerindeki depolama alanı</li>\r\n</ul>\r\n<ul>\r\n \t<li>Veritabanları gibi uygulamalar</li>\r\n</ul>\r\n<ul>\r\n \t<li>Diğer bilgisayarlarda depolanan bilgiler</li>\r\n</ul>\r\n<ul>\r\n \t<li>Belgeler</li>\r\n</ul>\r\n<ul>\r\n \t<li>Bilgisayar ve akıllı telefon arasında eşleyici takvimler</li>\r\n</ul>\r\nAğ cihazları çeşitli bağlantılar kullanarak birbirine bağlanır:\r\n<ul>\r\n \t<li><b>Bakır kablolar </b>– Cihazlar arasında veri iletimi gerçekleştirmek için elektrik sinyallerini kullanır</li>\r\n</ul>\r\n<ul>\r\n \t<li><b>Fiber optik kablolar </b>– Işık atımları şeklinde bilgi taşımak için cam veya plastik lif kullanır</li>\r\n</ul>\r\n<ul>\r\n \t<li><b>Kablosuz bağlantı</b> – Radyo sinyalleri, kızılötesi teknolojisi veya uydu iletimleri kullanır</li>\r\n</ul>"},{"_id":"57aee46defd68f06f8de6ac9","Title":"Kaynak Paylaşımı","Subtitle":"Ağlar","ImageUrl":"/Assets/DataImages/kaynak-paylasimi.png","Description":"Ağ iletişimi kuran bilgisayarların ve diğer cihazların sağladığı faydalar arasında düşük maliyet ve yüksek seviyede üretkenlik de yer alır. Ağda, verilerin çoğaltılmasını ve bozulmasını azaltmak için kaynaklar paylaşılabilir.\r\n\r\n<b>Daha Az Çevresel Aygıt İhtiyacı</b>\r\n\r\nŞekilde gösterildiği gibi çok sayıda aygıt bir ağa bağlanabilir. Ağdaki her bilgisayarın kendine özel bir yazıcısının veya yedekleme aygıtının olması gerekmez. Merkezi bir konuma birden çok yazıcı kurulabilir ve ağ kullanıcıları arasında paylaştırabilir. Tüm ağ kullanıcıları, yazdırma taleplerini yöneten merkezi bir yazıcı sunucusuna yazdırma işlerini gönderir. Yazıcı sunucusu, yazdırma işlerini birden çok yazıcıya dağıtabilir veya belirli bir yazıcının kullanılmasını gerektiren işleri sıraya koyar.\r\n\r\n<b>İletişim İmkanlarının Arttırılması</b>\r\n\r\nAğlar, ağ kullanıcıları arasında iletişim kurmak üzere kullanılabilen birçok farklı işbirliği aracı sağlar. Çevrimiçi işbirliği araçları arasında e-postalar, forumlar, sohbetler, ses, video ve anlık mesajlaşma araçları yer alır. Bu araçlar sayesinde kullanıcılar arkadaşlarıyla, aileleriyle ve iş arkadaşlarıyla iletişim kurabilirler.\r\n\r\n<b>Dosyaların Çoğaltılması ve Bozulmasının Önlenmesi</b>\r\n\r\nBir sunucu, ağ kaynaklarını yönetir. Sunucular, verileri depolar ve ağdaki kullanıcılarla paylaşır. Gizli veya hassas veriler korumaya alınabilir ve yalnızca bu verilere erişim izni olan kullanıcılar arasında paylaştırılabilir. Kullanıcıların, aynı anda başkalarının da erişim sağladığı dosyaları değiştirmesini veya bu dosyaların üzerine yazmasını önlemek için belge izleme yazılımı kullanılabilir.\r\n\r\n<b>Lisans Maliyetlerinin Düşürülmesi</b>\r\n\r\nTek bir bilgisayar için alınan uygulama lisansı pahalı olabilir. Çoğu yazılım satıcıları ağlara, yazılım maliyetini ciddi derecede düşüren site lisansları sunar. Site lisansı, bir kullanıcı grubunun veya tüm kuruluşun tek bir yazılım ücreti ödeyerek uygulamayı kullanmasına olanak sağlar.\r\n\r\n<b>Yönetimin Merkezileştirilmesi</b>\r\n\r\nMerkezi yönetim, ağdaki aygıtları ve verileri yönetmek için gereken kişi sayısını azaltarak şirketin zaman ve maliyet tasarrufu yapmasını sağlar. Her bir ağ kullanıcısının kendi veri ve aygıtlarını yönetmesi gerekmez. Tek bir yönetici, ağdaki kullanıcıların verilerini, aygıtlarını ve izinlerini denetleyebilir. Veriler merkezi bir konumda depolandığından, veri yedekleme işlemleri de daha kolay olur.\r\n\r\n<b>Kaynak Ayırma Olanağı Sağlaması</b>\r\n\r\nGörevleri işlemesi için tek bir bilgisayara aşırı seviyede yüklenilmemesini sağlamak için, veri işleme görevi birçok bilgisayara dağıtılabilir."},{"_id":"57aee4d2efd68f06f8de6acc","Title":"Ağları Tanımlama","Subtitle":"Ağ Türleri","ImageUrl":"/Assets/DataImages/ag-turleri.png","Description":"Veri ağları karmaşıklık, kullanım ve tasarım açısından gelişmeye devam etmektedir. Bir bilgisayar ağı aşağıdaki belirli özelliklerle tanımlanır:\r\n<ul>\r\n \t<li>Hizmet verdiği alan</li>\r\n</ul>\r\n<ul>\r\n \t<li>Veri depolama şekli</li>\r\n</ul>\r\n<ul>\r\n \t<li>Kaynak yönetme şekli</li>\r\n</ul>\r\n<ul>\r\n \t<li>Ağın düzenleniş şekli</li>\r\n</ul>\r\n<ul>\r\n \t<li>Kullanılan ağ iletişim cihazlarının türu</li>\r\n</ul>\r\n<ul>\r\n \t<li>Cihazları bağlamak için kullanılan ortamların türu</li>\r\n</ul>\r\nFarklı ağ türlerine farklı tanımlayıcı isimler verilmiştir. Tek bir ağ genellikle ortak bir organizasyon yapısı içindeki insanlara hizmet ve uygulamalar sunan tek bir coğrafi alanı kapsar. Bu tür ağa Yerel Alan Ağı (LAN) denir. Bir LAN birden fazla yerel ağlardan oluşabilir.\r\n\r\nBir LAN içinde tüm yerel ağlar, tek bir yönetimsel denetim grubu altındadır. Bu grup, ağ güvenlik ve erişim denetimi ilkelerini yönetir. Bu bağlamda Yerel Alan Ağı ifadesindeki \"Yerel\" sözcüğü, fiziksel anlamda birbirine yakın olmaktan çok tutarlı bir yerel denetimi ifade eder. LAN'daki cihazlar fiziksel anlamda birbirlerine yakın olabilir, ancak bu bir gereklilik değildir.\r\n\r\nLAN, eve veya küçük bir ofise kurulan tek bir yerel ağ kadar küçük çaplı olabilir. Zaman içinde LAN tanımı, birden çok bina ve konumda bulunan yüzlerce cihazdan oluşan birbirine bağlı yerel ağları da içine almaya başlamıştır."},{"_id":"57aee586efd68f06f8de6acd","Title":"WLAN (Kablosuz Yerel Ağ)","Subtitle":"Ağ Türleri","ImageUrl":"/Assets/DataImages/kaplosuz-yerel-ag.png","Description":"Kablosuz LAN (WLAN), kablosuz aygıtlar arasında veri iletimi için radyo dalgalarını kullanan bir LAN'dır. Uzun yıllardan beridir bir LAN'da, aygıtlar bakır kablolarla birbirine bağlanır. Bazı ortamlarda bakır kabloların kullanımı pratik olmayabilir, istenmeyebilir veya hatta mümkün olmayabilir. Bu durumlarda radyo dalgaları aracılığıyla veri iletmek ve almak için kablosuz aygıtlar kullanılır. LAN'larda olduğu gibi WLAN'da da dosya ve yazıcı gibi kaynakları paylaşabilir ve İnternet'e erişebilirsiniz.\r\n\r\nWLAN'da kablosuz cihazlar, belirli bir alandaki erişim noktalarına bağlanır. Erişim noktaları genellikle bakır kablolar ile ağa bağlanır. Ağdaki her istemci bilgisayarda bakır kablo kullanmak yerine yalnızca kablosuz erişim noktasını bağlamak için bakır kablo kullanılır. Tipik WLAN sistemlerinin aralıkları (kapsama yarıçapı) kullanılan teknolojiye bağlı olarak, kapalı yerlerde 30m'den az, açık yerlerde ise daha geniş mesafeler olarak değişir."},{"_id":"57aee5d2efd68f06f8de6ace","Title":"PAN (Kişisel Alan Ağı)","Subtitle":"Ağ Türleri","ImageUrl":"/Assets/DataImages/pan.png","Description":"Kişisel alan ağı (PAN), fare, klavye, yazıcı, akıllı telefon ve tabletler gibi bir kullanıcının yararlanabileceği aygıtları birbirine bağlayan bir ağdır. Bu aygıtların hepsi tek bir istemciye sunulur ve genellikle Bluetooth teknolojisi ile bağlanır.\r\n\r\nBluetooth, kısa mesafelerde aygıtların iletişimini sağlayan kablosuz teknolojidir. Bir Bluetooth aygıtı en fazla yedi farklı Bluetooth aygıtına bağlanabilir. Bu teknik özellik IEEE 802.15.1 standardı tarafından açıklanmıştır. Bluetooth aygıtları ses ve veri taşıma yeteneğine sahiptir. Bluetooth aygıtları, Endüstriyel Bilimsel ve Tıbbi (ISM) bandında olan 2,4-2,485 GHz radyo frekans aralığında faaliyet göstermektedir. Bluetooth standardı, Uyarlanabilir Frekans Atlaması (AFH) içermektedir. AFH, sinyallerin Bluetooth aralığındaki farklı frekansları kullanarak bu cihazlar arazında \"geçişler (hop)\" yapabilmesini sağlar ve dolayısıyla ortamda birden çok Bluetooth aygıtı varken kesinti ihtimali azaltılmış olur."},{"_id":"57aee674efd68f06f8de6acf","Title":"MAN (Metropol Alan Ağı)","Subtitle":"Ağ Türleri","ImageUrl":"/Assets/DataImages/man.png","Description":"Metropol alan ağı (MAN) büyük bir kampüse ya da şehir geneline yayılan bir ağdır. Ağ, kablosuz veya fiber optik omurgalar üzerinden birbirine bağlanmış birçok binayı kapsamaktadır. Iletişim bağlantıları ve ekipman, genellikle kullanıcıların oluşturduğu bir birliğe veya kullanıcılara hizmet sunan bir şebeke servis sağlayıcısına aittir. MAN bölgesel kaynakların paylaşımını sağlamak için yüksek hızlı ağ olarak görev yapabilir."},{"_id":"57aee6e9efd68f06f8de6ad0","Title":"WAN (Geniş Alan Ağı)","Subtitle":"Ağ Türleri","ImageUrl":"/Assets/DataImages/wan.png","Description":"Geniş Alan Ağı (WAN), coğrafi olarak farklı konumlarda bulunan LAN gibi birçok küçük ağı birbirine bağlar. Bilinen en yaygın WAN örneği İnternet'tir. İnternet, birbirine bağlı milyonlarca LAN'dan oluşan geniş bir WAN'dır. WAN teknolojisi, kurumsal ağlara veya araştırma ağlarına bağlanmak için de kullanılır. Farklı konumlardaki bu LAN'ları birbirine bağlamak için telekomünikasyon hizmet sağlayıcıları (TSP) kullanılır."},{"_id":"57aee73aefd68f06f8de6ad1","Title":"Eşler Arası Ağlar","Subtitle":"Ağ Türleri","ImageUrl":"/Assets/DataImages/esler-arasi-ag.png","Description":"Eşler arası ağda, ne bilgisayarlar arasında bir hiyerarşi, ne de herhangi özel bir sunucu vardır. İstemci de denilen her bir cihazın, eşdeğer kabiliyetleri ve sorumlulukları vardır. Her bir kullanıcı kendi kaynaklarından sorumludur, hangi verileri ve aygıtları paylaşacağına ya da yükleyeceğine kendi karar verebilir. Her bir kullanıcı kendi bilgisayarındaki kaynaklardan sorumlu olduğundan, ağda merkezi bir denetim veya yönetim noktası bulunmaz.\r\n\r\nEşler arası ağlar, on veya daha az bilgisayarın bulunduğu ortamlarda en iyi şekilde çalışır. Eşler arası ağlar, aynı zamanda büyük ağların içinde bulunabilir. Büyük bir istemci ağında bile kullanıcılar, diğer kullanıcılarla ağ sunucusu kullanmadan doğrudan kaynak paylaşabilir. Evinizde birden fazla bilgisayarınız varsa, eşler arası ağ kurabilirsiniz. Diğer bilgisayarlarla dosya paylaşabilir, bilgisayarlar arasında ileti gönderebilir ve paylaşılan bir yazıcıdan belge yazdırabilirsiniz.\r\n\r\nEşler arası ağların birkaç dezavantajı vardır:\r\n<ul>\r\n \t<li>Merkezi bir ağ yönetimi olmadığı için ağdaki kaynakların kim tarafından denetleneceğini belirlemek zordur.</li>\r\n</ul>\r\n<ul>\r\n \t<li>Merkezi bir güvenlik yoktur. Her bilgisayar, veri koruması için kendi güvenlik önlemini almalıdır.</li>\r\n</ul>\r\n<ul>\r\n \t<li>Ağdaki bilgisayar sayısı arttıkça ağ daha karmaşık ve yönetilmesi zor bir hal alır.</li>\r\n</ul>\r\n<ul>\r\n \t<li>Merkezi bir veri depolama ortamı bulunmayabilir. Veri yedeklemeleri ayrı ayrı gerçekleştirilmelidir. Bu sorumluluk her kullanıcının kendisine aittir.</li>\r\n</ul>"},{"_id":"57aee7e0efd68f06f8de6ad2","Title":"İstemci/Sunucu Ağları","Subtitle":"Ağ Türleri","ImageUrl":"/Assets/DataImages/server-ag.png","Description":"Sunuculara, e-posta veya web sayfaları gibi hizmetleri istemcilere sunacak yazılımlar yüklenir. Her servis ayrı bir sunucu yazılımı gerektirir. Örneğin, bir sunucunun ağa web hizmeti sağlayabilmesi için web sunucusu yazılımına gereksinimi vardır.\r\n\r\nİstemci/sunucu ağında, istemci bilgiyi veya hizmetleri sunucudan talep eder. Sunucu, istemciye istenen bilgi veya hizmeti sağlar. İstemci/sunucu ağ üzerindeki sunucular, istemci tarafından istenen özel kayıtları teslim etmeden önce veritabanında sıralama yapmak gibi istemci makinesi için işlem gerektiren bazı görevleri yerine getirir. Bu, ağ üzerindeki kaynakların kimin tarafından kontrol edildiğinin belirlenmesini kolaylaştıran merkezi ağ yönetimini sağlar. Kaynaklar, merkezi bir ağ yönetimi tarafından kontrol edilmektedir.\r\n\r\nSunucu yazılımı olan bir bilgisayar, bir veya birçok istemciye aynı anda hizmet sağlayabilir. Ayrıca, tek bir bilgisayar birden fazla türdeki sunucu yazılımlarını çalıştırabilir. Bir ev ya da küçük işletme ağında, bir bilgisayarın, dosya sunucusu, web sunucusu ve e-posta sunucusu olarak hareket etmesi gerekli olabilir. Şirket ortamında çalışanlar, e-posta sunucusu gibi davranan tek bir bilgisayara erişebilir. Bu e-posta sunucusu, sadece e-posta göndermek, almak ve saklamak için kullanılır. Çalışanların bilgisayarındaki e-posta istemcisi, okunmamış herhangi bir e-posta için e-posta sunucusuna istek gönderir. Sunucu, istenilen e-postayı istemciye göndererek yanıt verir.\r\n\r\nTek bir bilgisayar da istemci yazılımların birden fazla türünü çalıştırabilir. Gerekli olan her hizmet için istemci yazılımı bulunmalıdır. Birden fazla istemci yazılımı yüklü olan bir istemci aynı anda birden çok sunucuya bağlanabilir. Örneğin, bir kullanıcı e-postasını kontrol ederken, bir web sayfası görüntüleyebilir, anlık mesajlaşma yapabilir ve İnternet radyosu dinleyebilir.\r\n\r\nİstemci/sunucu modeli, merkezi ağ yönetimini sağlayarak ağ üzerindeki kaynakları kimin denetleyeceğini daha kolay belirlenmesini sağlar. Veri yedekleri ve güvenlik önlemleri ağ yöneticisi tarafından alınır. Ağ yöneticisi ayrıca, ağ kaynaklarına yönelik kullanıcı erişimini de denetler. Ağdaki verilerin tümü, merkezi bir dosya sunucusuna depolanır. Ağdaki paylaşılan yazıcılar, merkezi bir yazıcı sunucusu tarafından yönetilir. Her kullanıcıya, kullanım iznine sahip olduğu ağ kaynaklarına erişim sağlayabilmesi için yetkili bir kullanıcı adı ve parola sağlanmalıdır."}]